var myChart2 = echarts.init(document.getElementById('main2'));
var option2 = {
    dataZoom: [
        {
            id: 'dataZoomX',
            type: 'slider',
            xAxisIndex: [0],
            filterMode: 'filter', // 设定为 'filter' 从而 X 的窗口变化会影响 Y 的范围。
            start: 0,
            end: 100,
        }],
    tooltip: {
        trigger: 'axis',
        formatter: function (params) {
            let res = params[0].name +'年<br/>';
            let arr = [2,3,0,1,4,5];
            arr.forEach(function(num){
                value = Math.floor(params[num].value*10000)/100+'%'
                res += params[num].seriesName +": "+ value + '<br/>'
            })
            return res
        },
        position:[780,60],
        textColor:"#f2e9de",
        borderColor:"#f2e9de",
        borderWidth:3,
        backgroundColor:'#c75f65',
    },

    legend: {
        right:90,
        data:['小学男','小学女','初中男','初中女','高中男','高中女']
    },
    xAxis: [
        {
            type: 'category',
            name:'年份',
            data: ['2002','2003','2004','2005','2006','2007','2008','2009','2010','2011','2012','2013','2014','2015','2016','2017'],
            axisPointer: {
                type: 'shadow'
            },
            axisLabel:{
                interval:1
            },
            axisLine:{
                lineStyle:{
                    color:"#DC9FB4",
                    width:2,
                }
            },
        }
    ],
    yAxis :
        {
            name:"比例",
            type : 'value',
            splitLine:false,
            max:0.5,
            label:{
                show:true,
                formatter:'{a}'
            },
            axisLine:{
                lineStyle:{
                    color:"#DC9FB4",
                    width:2,
                }
            },
            axisLabel:{
                formatter:function(params){
                    return params*100 + "%"
                }
            },
        }
    ,
    series: [
        {
            name:'小学男',
            type:'line',
            symbol:"none",
            color:'#ffecd4',
            label:{
                show:true,
                formatter:'{a}'
            },
            lineStyle:{
                type:"dashed"
            },
            data:[0.337407488409443, 0.321707046202669, 0.311414700312915, 0.323700069187873, 0.316763399509003, 0.301837330982611, 0.293849425867643, 0.282748154165276, 0.265755573622631, 0.255855406028053, 0.24971251096198, 0.245004435489933, 0.242908319108795, 0.246673214698747, 0.239285967660076, 0.235215403075527]
        },
        {
            name:'小学女',
            type:'line',
            symbol:"none",
            color:'#c75f65',
            label:{
                show:true,
                formatter:'{a}'
            },
            lineStyle:{
                type:"dashed"
            },
            data:[0.362234728573103, 0.347119330597452, 0.336463801775554, 0.342075490869317, 0.344869330556671, 0.334387474632842, 0.329890189321203, 0.320150049226806, 0.310068072125959, 0.296363351029828, 0.288725339237752, 0.283075758110775, 0.282908412993709, 0.278301686211687, 0.273688919046472, 0.270119738995466]
        },
        {
            name:'初中男',
            type:'line',
            symbol:"none",
            color:'#ffecd4',
            label:{
                show:true,
                formatter:'{a}'
            },
            smooth:true,
            data:[0.409899178435304,0.410505949952796,0.421833241562697,0.415893600635756,0.420218464856887,0.430507372072853,0.4368669237462,0.442927805741307,0.440614827109203,0.433901235973,0.431255995198231,0.424525252221503,0.423221184080495,0.403753462936415,0.409599016231811,0.401602828173354]
        },
        {
            name:'初中女',
            type:'line',
            symbol:"none",
            color:'#c75f65',
            label:{
                show:true,
                formatter:'{a}'
            },
            smooth:true,
            data:[0.341938921189298,0.349256343558788,0.363347923480746,0.350722241223519,0.359165776441489,0.373467805621163,0.381312836313456,0.389968835360392,0.392511142905015,0.393361708968563,0.390132186753257,0.390906201814993,0.378916228875862,0.361812774090095,0.366242164977568,0.35875076983291]
        },
        {
            name:'高中男',
            type:'bar',
            symbol:"none",
            color:'#ffecd4',
            data:[0.139874686758634, 0.14866806639438, 0.148201743194423, 0.140552946277459, 0.145214562431707, 0.151753088877198, 0.15380373875277, 0.153808076705493, 0.164235969733165, 0.173524514780093, 0.176676271449487, 0.180374084710339, 0.183900817536609, 0.17958351788989, 0.184321922131691, 0.19182513395301]
        },
        {
            name:'高中女',
            type:'bar',
            symbol:"none",
            color:'#c75f65',
            data:[0.108720765830074, 0.118233723543074, 0.119391267899843, 0.108077609819803, 0.113108738378282, 0.116104327460862, 0.119671006038127, 0.121810436082878, 0.135637865346668, 0.134964804770781, 0.145116964421453, 0.149319083322543, 0.149357841818089, 0.148613473363794, 0.153231905291708, 0.158594213158818]
        },
    ]
};
myChart2.setOption(option2);